tutorials/multiphase/multiphaseEulerFoam/damBreak4phaseFine/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
     water
     {
         nu         1e-06;
         kappa      1e-06;
         Cp         4195;
         rho        1000;

         diameterModel constant;
         constantCoeffs
         {
             d               1e-3;
         }
     }

     oil
     {
         nu         1e-06;
         kappa      1e-06;
         Cp         4195;
         rho        500;

         diameterModel constant;
         constantCoeffs
         {
             d               1e-3;
         }
     }

     mercury
     {
         nu         1.125e-07;
         kappa      1e-06;
         Cp         4195;
         rho        13529;

         diameterModel constant;
         constantCoeffs
         {
             d               1e-3;
         }
     }

     air
     {
         nu         1.48e-05;
         kappa      2.63e-2;
         Cp         1007;
         rho        1;

         diameterModel constant;
         constantCoeffs
         {
             d              3e-3;
         }
     }
);

sigmas
(
    (air water)     0.07
    (air oil)       0.07
    (air mercury)   0.07
);

interfaceCompression
(
    (air water)     1
    (air oil)       1
    (air mercury)   1
);

virtualMass
(
);

drag
(
    (air water)
    {
        type blended;

        air
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        water
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-3;
        residualSlip 1e-3;
    }

    (air oil)
    {
        type blended;

        air
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        oil
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-3;
        residualSlip 1e-3;
    }

    (air mercury)
    {
        type blended;

        air
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        mercury
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-3;
        residualSlip 1e-3;
    }

    (water oil)
    {
        type blended;

        water
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        oil
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-3;
        residualSlip 1e-3;
    }

    (water mercury)
    {
        type blended;

        water
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        mercury
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-3;
        residualSlip 1e-3;
    }

    (oil mercury)
    {
        type blended;

        oil
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        mercury
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-3;
        residualSlip 1e-3;
    }
);


// This is a dummy to support the Smagorinsky model
transportModel  Newtonian;
nu              0;


// ************************************************************************* //
